/*В JavaScript функция `Math.max()` используется для поиска максимального значения среди набора чисел. 
  Она принимает несколько аргументов или массив чисел и возвращает наибольшее значение.

Вот пример использования `Math.max()`:

```javascript
const numbers = [5, 8, 2, 10, 3];
const maxNumber = Math.max(...numbers);
console.log(maxNumber);  // Вывод: 10
```

В этом примере переменная `numbers` содержит массив чисел. 
Путем передачи чисел из массива в `Math.max()` с помощью оператора расширения `...`, 
находим максимальное значение из чисел и сохраняем его в переменной `maxNumber`. Затем выводим это максимальное значение, которое равно 10.
*/
