/*
В JavaScript функция `Math.floor()` используется для округления числа вниз до ближайшего целого значения.

Синтаксис функции `Math.floor()` выглядит следующим образом:

```javascript
Math.floor(x)
```

- `x`: Число, которое нужно округлить вниз.

Вот пример использования функции `Math.floor()`:

```javascript
console.log(Math.floor(3.7));  // Вывод: 3
console.log(Math.floor(9.1));  // Вывод: 9
console.log(Math.floor(-2.5));  // Вывод: -3
```

В этом примере функция `Math.floor()` вызывается с разными числами. Она округляет каждое число вниз до ближайшего целого значения. 
Таким образом, число `3.7` округляется до `3`, число `9.1` округляется до `9`, а число `-2.5` округляется до `-3`.

Функция `Math.floor()` возвращает округленное целое число, которое меньше или равно исходному числу `x`.
*/
