/*
В JavaScript метод `reverse()` применяется к массиву и изменяет порядок элементов массива, разворачивая его задом наперед.

Синтаксис метода `reverse()` выглядит следующим образом:

```javascript
array.reverse()
```

- `array`: Исходный массив, который нужно развернуть.

Вот пример использования метода `reverse()`:

```javascript
const array = [1, 2, 3, 4, 5];
array.reverse();
console.log(array);  // Вывод: [5, 4, 3, 2, 1]
```

В этом примере метод `reverse()` применяется к массиву `[1, 2, 3, 4, 5]`. 
Он изменяет порядок элементов массива, и после вызова массив будет иметь следующий порядок элементов: `[5, 4, 3, 2, 1]`.

Метод `reverse()` изменяет исходный массив, переставляя его элементы в обратном порядке. 
Обратите внимание, что метод `reverse()` не возвращает новый массив, а изменяет исходный массив напрямую.
*/
