/*
В JavaScript оператор `%` используется для получения остатка от деления двух чисел. Он возвращает остаток от деления левого операнда на правый операнд.

Синтаксис оператора `%` выглядит следующим образом:

```javascript
operand1 % operand2
```

- `operand1` и `operand2`: Числовые операнды, между которыми будет выполнено деление, и от которых будет получен остаток.

Вот пример использования оператора `%`:

```javascript
console.log(7 % 3);  // Вывод: 1
console.log(10 % 2);  // Вывод: 0
console.log(15 % 4);  // Вывод: 3
```

В этом примере оператор `%` применяется к различным числам. 
В каждом случае оператор `%` возвращает остаток от деления левого операнда на правый операнд. 
Например, `7 % 3` дает остаток 1, так как 7 делится на 3 с остатком 1. А `10 % 2` дает остаток 0, так как 10 делится на 2 без остатка.

Оператор `%` может быть полезен, например, для проверки четности или нечетности числа или для определения, делится ли число на другое число без остатка.
*/
