/*
В JavaScript оператор `!==` (строгое неравенство) используется для проверки неравенства между двумя значениями.
Он возвращает `true`, если значения не равны по значению или по типу, и возвращает `false`, если значения равны по значению и типу.

Синтаксис оператора `!==` выглядит следующим образом:

```javascript
operand1 !== operand2
```

- `operand1` и `operand2`: Операнды, значения которых будут сравниваться на неравенство.

Вот пример использования оператора `!==`:

```javascript
console.log(5 !== 3);      // Вывод: true
console.log(5 !== 5);      // Вывод: false
console.log("hello" !== "world");  // Вывод: true
console.log(true !== false);       // Вывод: true
```

В этом примере оператор `!==` применяется для сравнения различных пар значений. 
Он возвращает `true`, если значения не равны по значению или по типу.
Например, `5 !== 3` вернет `true`, так как числа 5 и 3 не равны по значению. А `5 !== 5` вернет `false`, так как числа 5 и 5 равны по значению.

Оператор `!==` полезен, когда необходимо проверить, что два значения не равны по значению или по типу, а не просто по значению.
*/
